//CBL5         JOB 1,NOTIFY=&SYSUID
//COMPILE      EXEC IGYWCLG
//COBOL.SYSIN  DD *
       Identification Division.
       Program-ID. CBL5.
      *
       Environment Division.
      *
       Data Division.
       Working-Storage Section.
       01 myInput.
          05 num1              pic x(5).
          05 num2              pic x(5).
          05 filler            pic x(70).
      *
       01 myInput_packed.
          05 num1_packed       pic 99999 comp-3.
          05 num2_packed       pic 99999 comp-3.
          05 num_total         pic 99999999 comp-3.
      *
       Procedure Division.
      *
           Accept  myInput.
           Move num1 to num1_packed.
           Move num2 to num2_packed.
           Add  num1_packed num2_packed Giving num_total
            on size error display "truncation occurred".
           Display num_total.
           STOP RUN.
//GO.SYSIN     DD *
0033300222
