//BADJCL   JOB 1,NOTIFY=&SYSUID
//SORTPGM  EXEC  PGM=SORT
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DSN=ZOS.PUBLIC.DATA(IBMCEO),DISP=SHR
//SYSIN    DD  DSN=ZOS.PUBLIC.DATA(SORTCMD),DISP=SHR
//SORTOUT  DD  SYSOUT=*
/*
