//CBLRDWR      JOB 1,NOTIFY=&SYSUID
//COMPILE      EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..SOURCE(CBLRDWR),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(CBLRDWR),DISP=SHR
//  IF RC = 0 THEN
//RUN          EXEC PGM=CBLRDWR
//STEPLIB      DD DSN=&SYSUID..LOAD,DISP=SHR
//XYZINX       DD DISP=SHR,DSN=ZOS.PUBLIC.DATA(TESTDATA)
//XYZOUT       DD DISP=SHR,DSN=&SYSUID..P2.OUTPUT(#13)
//CEEDUMP      DD DUMMY
//  ENDIF
