//COMPILE#       JOB 1,NOTIFY=&SYSUID
//DEVLIB         JCLLIB ORDER=&SYSUID..JCL
//COMPILE        EXEC COBCLG
//COBOL.SYSIN    DD DISP=SHR,DSN=&SYSUID..SOURCE(SIMPLE)
//COBOL.SYSPRINT DD DSN=&&TMP,UNIT=SYSDA,SPACE=(TRK,(5,1)),
// DISP=(MOD,PASS)
//COPY     EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DISP=(MOD,DELETE),DSN=&&TMP
//SORTOUT  DD DISP=SHR,DSN=&SYSUID..P3.OUTPUT(#12)
//SYSIN    DD *
  OPTION COPY
/*
