//COMPILE     JOB 1,NOTIFY=&SYSUID
//DEVLIB      JCLLIB ORDER=&SYSUID..JCL
//COMPILE     EXEC COBCLG
//COBOL.SYSIN DD DISP=SHR,DSN=&SYSUID..SOURCE(SIMPLE)
/*
