//PAYROLL      JOB 1,NOTIFY=&SYSUID
//COMPILE      EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..SOURCE(PAY),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(PAY),DISP=SHR
