//COPYFILE JOB 1,NOTIFY=&SYSUID,REGION=0M,MSGLEVEL=(0,0)                JOB01854
//*******************************************//
//*  Copy Java source from PDS to Unix file *//
//*******************************************//
//COPYFILE EXEC PGM=BPXBATCH,
//         PARM='sh cp -R world.output "//P3.OUTPUT(#05)"'
//STDOUT   DD PATH='/dev/null'
//STDERR   DD PATH='/dev/null'
//CEEDUMP  DD PATH='/dev/null'
