//COPYJCL  JOB 1,NOTIFY=&SYSUID
//COPY     EXEC PGM=IEBGENER
//SYSUT1   DD DSN=ZOS.PUBLIC.WORLD.UNIV,DISP=SHR
//SYSUT2   DD DSN=&SYSUID..WORLD.UNIV,
//         DISP=(NEW,CATLG,DELETE),STORCLAS=MTM,
//         SPACE=(TRK,(1,0),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//    IF RC = 0 THEN
//LISTD    EXEC PGM=IKJEFT01
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD DISP=SHR,DSN=&SYSUID..P2.OUTPUT(#10)
//SYSTSIN  DD *
  LISTD WORLD.UNIV LABEL
  LISTC ENT(WORLD.UNIV)
//    ENDIF
//DELETE   EXEC PGM=IEFBR14
//DD1      DD DSN=&SYSUID..WORLD.UNIV,DISP=(MOD,DELETE)
