//DSNAMEX  JOB  1,NOTIFY=&SYSUID
//*============================================================
//DELETE   EXEC PGM=IEFBR14
//*------------------------------------------------------------
//SEQ      DD DISP=(OLD,DELETE),DSN=&SYSUID..CHARSET.SEQ
//*------------------------------------------------------------
//PDS      DD DISP=(OLD,DELETE),DSN=&SYSUID..CHARSET.PDS
//*------------------------------------------------------------
//PDSE     DD DISP=(OLD,DELETE),DSN=&SYSUID..CHARSET.PDSE
//*------------------------------------------------------------
/*
