//HOROSCOP JOB 1,NOTIFY=&SYSUID                                         JOB05274
//TSOBATCH EXEC PGM=IKJEFT01
//SYSEXEC  DD DISP=SHR,DSN=&SYSUID..REXX.CLIST
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD DISP=SHR,DSN=&SYSUID..P2.OUTPUT(#15)
//SYSTSIN  DD *
%HOROSCOP
GO
4
GO
1
no
