//IPLMSG   JOB 1,NOTIFY=&SYSUID                                         JOB05274
//TSOBATCH EXEC PGM=IKJEFT01
//SYSEXEC  DD DISP=SHR,DSN=&SYSUID..REXX.CLIST
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD DISP=SHR,DSN=&SYSUID..P2.OUTPUT(#16)
//SYSTSIN  DD *
%IPLMSG
