//JOB04 JOB
//STEP1    EXEC PGM=IEFBR14
//STEP2    EXEC PGM=IEFBR14
//STEP3    EXEC PGM=SORT
//SORTIN   DD DSN=&SYSUID..DATA(PRASORT),DISP=SHR
//SORTOUT  DD DSN=&SYSUID..P2.OUTPUT(#05),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(1,4,CH,A)
/*
